[
  {
    "title": "Temporal: Building AI Agents with Durable Conversations",
    "date": "2025-12-21",
    "description": "Traditional AI agent implementations face a fundamental challenge: how do you maintain conversational state across long-running interactions? This article explores how to build production-ready AI agents using the Temporal plugin combined with the AIAgent framework, demonstrating how workflows orchestrate LLM interactions, manage tool execution, and coordinate multi-step conversations that can span hours or days.",
    "tags": [
      "Temporal",
      "AI Agents",
      "Workflows",
      "LLM"
    ],
    "slug": "Building AI Agents with Durable Conversations",
    "path": "/articles/Building%20AI%20Agents%20with%20Durable%20Conversations",
    "file": "Building AI Agents with Durable Conversations.md"
  },
  {
    "title": "Temporal Plugin for CakePHP: Building Reliable Workflows with Approval Order Flow",
    "date": "2025-12-17",
    "description": "Traditional queue systems are excellent at handling independent jobs, but what happens when you need workflows that span hours or days? What happens when workflows need to pause and wait for human approval? This article explores how to build a real-world approval workflow using the Temporal plugin for CakePHP, implementing an order approval system that demonstrates how workflows can pause indefinitely, receive signals from web controllers, and coordinate activities across multiple languages and services.",
    "tags": [
      "Temporal",
      "CakePHP",
      "Workflows",
      "Queue Systems",
      "PHP",
      "Go",
      "Distributed Systems"
    ],
    "slug": "Temporal Plugin for CakePHP - Building Reliable Workflows with Approval Order Flow",
    "path": "/articles/Temporal%20Plugin%20for%20CakePHP%20-%20Building%20Reliable%20Workflows%20with%20Approval%20Order%20Flow",
    "file": "Temporal Plugin for CakePHP - Building Reliable Workflows with Approval Order Flow.md"
  },
  {
    "title": "When Jobs Need to Work Together",
    "date": "2025-12-08",
    "description": "Most queue systems are great at running independent jobs. You push a job, a worker picks it up, it runs, it's done. This works perfectly until you need jobs that depend on each other. Until you need to process a thousand items in parallel and track when they're all done. Until you need to roll back three completed operations because the fourth one failed.",
    "tags": [
      "BatchQueue",
      "Parallel Processing",
      "Saga Pattern",
      "Workflows",
      "Jobs",
      "Distributed Systems",
      "Queue"
    ],
    "slug": "BatchQueue-Article",
    "path": "/articles/BatchQueue-Article",
    "file": "BatchQueue-Article.md"
  },
  {
    "title": "Railway Oriented Programming with PHP 8.5 Pipes - From Theory to Practice",
    "date": "2025-12-06",
    "description": "This article explores the evolution from Railway Oriented Programming concepts to practical application using PHP 8.5's pipe operator. We'll combine ROP with functional pipes to create elegant, production-ready code that handles complex business logic with grace and clarity.",
    "tags": [
      "PHP 8.5",
      "Railway Programming",
      "Functional Programming",
      "Error Handling",
      "CakePHP"
    ],
    "slug": "Railway Oriented Programming with PHP 8.5 Pipes - From Theory to Practice",
    "path": "/articles/Railway%20Oriented%20Programming%20with%20PHP%208.5%20Pipes%20-%20From%20Theory%20to%20Practice",
    "file": "Railway Oriented Programming with PHP 8.5 Pipes - From Theory to Practice.md"
  },
  {
    "title": "PHP 8.5 Pipe Operator - A New Era of Readable Code",
    "date": "2025-12-05",
    "description": "The PHP 8.5 pipe operator brings a powerful new way to write clear, maintainable code. Drawing inspiration from functional programming languages and Unix command-line tools, this feature transforms how we chain operations and handle data flow in our applications.",
    "tags": [
      "PHP",
      "PHP 8.5",
      "Functional Programming",
      "Code Quality"
    ],
    "slug": "PHP 8.5 Pipe Operator - A New Era of Readable Code",
    "path": "/articles/PHP%208.5%20Pipe%20Operator%20-%20A%20New%20Era%20of%20Readable%20Code",
    "file": "PHP 8.5 Pipe Operator - A New Era of Readable Code.md"
  }
]